{
    "locales": {
        "en": {
            "title": "<span class='text-primary'>Professional</span> Experience",
            "description": "A look into my work experience and career journey."
        },

        "es": {
            "title": "<span class='text-primary'>Experiencia</span> Profesional",
            "description": "Un vistazo a mi experiencia laboral y trayectoria profesional."
        },

        "fr": {
            "title": "Expérience <span class='text-primary'>Professionnelle</span>",
            "description": "Un aperçu de mon expérience professionnelle et de mon parcours de carrière."
        },

        "zh": {
            "title": "<span class='text-primary'>专业</span> 经验",
            "description": "了解我的工作经验和职业之旅。"
        }
    },

    "items": [
        {
            "id": "experience_item_1",
            "place": "@link{places.optimisa}",
            "period": ["2017/01", "2017/03"],
            "locales": {
                "en": {
                    "title": "OPTIMISA S.A. / Software Engineer (Professional Practice)",
                    "description": "Professional practice that consisted of creating a Web Application for the company to control the time of its employees who worked in the same company or in external companies/entities. With the added benefit of including the storage of GPS data.",
                    "tags": ["React", "Javascript", "Wireframing", "Prototyping", "Responsive Design", "User Research"]
                },
                "es": {
                    "title": "OPTIMISA S.A. / Ingeniero de Software (Práctica Profesional)",
                    "description": "Práctica profesional que consistió en realizar una Aplicación Web para el control de horario por parte de la empresa para sus empleados que trabajaban en la misma empresa o en empresas/ entidades externas. Con el añadido de que incorporaba el guardado de los datos del GPS.",
                    "tags": ["React", "Javascript", "Prototipado", "Diseño Responsivo", "Investigación de Usuarios", "Wireframing"]
                }
            }
        },

        {
            "id": "experience_item_2",
            "place": "@link{places.sonda}",
            "period": ["2018/10", "2019/12"],
            "locales": {
                "en": {
                    "title": "SONDA S.A. / Software Enginner",
                    "description": "The work as a software developer carried out in this company consisted of a mobile application for the Transantiago 3.0 project, with cutting-edge tools. This application was developed from scratch, and work was done on the App.",
                    "tags": ["Java", "Android", "Ionic", "Typescript"]
                },
                "es": {
                    "title": "SONDA S.A. / Desarrollador de Software",
                    "description": "El trabajo como desarrollador de software realizado en esta empresa, consistió en una aplicación móvil para el proyecto transantiago 3.0,  con herramientas de vanguardia. Esta aplicación se desarrollo desde 0, y se trabajó en la App.",
                    "tags": ["Java", "Android", "Ionic", "Typescript"]
                }
            }
        },

        {
            "id": "experience_item_3",
            "place": "@link{places.principal}",
            "period": ["2020/09", "2022/09"],
            "locales": {
                "en": {
                    "title": "Principal Financial Group / Software Engineer",
                    "description": "Work was done at Principal, adding functionalities to its main page to facilitate client investments, as well as incorporating various products and features. Planning was based on an adaptation of the agile Scrum methodology, using Git and Github for software version control and Targetprocess for task management. The frontend development of the application was carried out with the Vue2 and Vue3 frameworks, managing states with Vuex and Pinia, and integrating various APIs. Additionally, unit tests were implemented to ensure code quality.",
                    "tags": ["Vue2", "Vue3", "Javascript", "Typescript"]
                },
                "es": {
                    "title": "Principal Financial Group / Software Engineer",
                    "description": "Se trabajó en Principal, añadiendo funcionalidades a su página principal para facilitar las inversiones de los clientes, así como incorporando diversos productos y funcionalidades. La planificación se realizó basándose en una adaptación de la metodología ágil Scrum, utilizando Git y Github para el control de versiones del software y targetprocess para la gestión de tareas. El desarrollo frontend de la aplicación se llevó a cabo con los frameworks Vue2 y Vue3, manejando los estados con Vuex y Pinia, y se integraron distintas API. Además, se implementaron test unitarios para garantizar la calidad del código",
                    "tags": ["Vue2", "Vue3", "Javascript", "Typescript"]
                }
            }
        }
    ]
}