{
    "locales": {
        "en": {
            "title": "<span class='text-primary'>Professional</span> Experience",
            "description": "A look into my work experience and career journey."
        },

        "es": {
            "title": "<span class='text-primary'>Experiencia</span> Profesional",
            "description": "Un vistazo a mi experiencia laboral y trayectoria profesional."
        },

        "fr": {
            "title": "Expérience <span class='text-primary'>Professionnelle</span>",
            "description": "Un aperçu de mon expérience professionnelle et de mon parcours de carrière."
        },

        "zh": {
            "title": "<span class='text-primary'>专业</span> 经验",
            "description": "了解我的工作经验和职业之旅。"
        }
    },

    "items": [
        {
            "id": "experience_item_1",
            "place": "@link{places.optimisa}",
            "period": ["2017/01", "2017/03"],
            "locales": {
                "en": {
                    "title": "OPTIMISA S.A./Software Engineer (Professional Practice)",
                    "description": "Professional practice that consisted of creating a Web Application for the company to control the time of its employees who worked in the same company or in external companies/entities. With the added benefit of including the storage of GPS data.",
                    "tags": ["React", "Javascript", "Wireframing", "Prototyping", "Responsive Design", "User Research"]
                },
                "es": {
                    "title": "OPTIMISA S.A./Ingeniero de Software (Práctica Profesional)",
                    "description": "Práctica profesional que consistió en realizar una Aplicación Web para el control de horario por parte de la empresa para sus empleados que trabajaban en la misma empresa o en empresas/ entidades externas. Con el añadido de que incorporaba el guardado de los datos del GPS.",
                    "tags": ["React", "Javascript", "Prototipado", "Diseño Responsivo", "Investigación de Usuarios", "Wireframing"]
                }
            }
        },

        {
            "id": "experience_item_2",
            "place": "@link{places.sonda}",
            "period": ["2018/10", "2019/12"],
            "locales": {
                "en": {
                    "title": "SONDA S.A. / Software Enginner",
                    "description": "The work as a software developer carried out in this company consisted of a mobile application for the Transantiago 3.0 project, with cutting-edge tools. This application was developed from scratch, and work was done on the App.",
                    "tags": ["Java", "Android", "Ionic", "Typescript"]
                },
                "es": {
                    "title": "SONDA S.A. / Desarrollador de Software",
                    "description": "El trabajo como desarrollador de software realizado en esta empresa, consistió en una aplicación móvil para el proyecto transantiago 3.0,  con herramientas de vanguardia. Esta aplicación se desarrollo desde 0, y se trabajó en la App.",
                    "tags": ["Java", "Android", "Ionic", "Typescript"]
                }
            }
        },

        {
            "id": "experience_item_3",
            "place": "@link{places.principal}",
            "period": ["2020/09", "2022/09"],
            "locales": {
                "en": {
                    "title": "Lead UX Designer",
                    "description": "Drove UX initiatives by overseeing a team of designers, crafting design strategies, and spearheading cross-functional collaborations with product managers, engineers, and executives. Focused on creating user-centric designs that aligned with business objectives and resulted in enhanced user satisfaction.",
                    "tags": ["Sketch", "Adobe XD", "InVision", "Design Strategy", "Cross-Functional Collaboration"]
                },
                "es": {
                    "title": "Designer UX Principal",
                    "description": "Impulsé iniciativas de UX supervisando un equipo de diseñadores, elaborando estrategias de diseño y liderando colaboraciones multifuncionales con gerentes de producto, ingenieros y ejecutivos. Centrado en crear diseños centrados en el usuario que se alinearan con los objetivos comerciales y que dieron como resultado una mayor satisfacción del usuario.",
                    "tags": ["Sketch", "Adobe XD", "InVision", "Estrategia de Diseño", "Colaboración Multifuncional"]
                },
                "fr": {
                    "title": "Designer UX Principal",
                    "description": "A piloté les initiatives UX en supervisant une équipe de concepteurs, en élaborant des stratégies de conception et en dirigeant des collaborations interfonctionnelles avec les responsables de produits, les ingénieurs et les cadres. Axé sur la création de designs centrés sur l'utilisateur alignés sur les objectifs commerciaux et aboutissant à une satisfaction accrue des utilisateurs.",
                    "tags": ["Sketch", "Adobe XD", "InVision", "Stratégie de Conception", "Collaboration Interfonctionnelle"]
                },
                "zh": {
                    "title": "首席用户体验设计师",
                    "description": "通过监督设计团队、制定设计战略，并与产品经理、工程师和高管共同推动跨职能合作，推动了用户体验的创新。专注于创建符合业务目标的以用户为中心的设计，从而实现了增强的用户满意度。",
                    "tags": ["Sketch", "Adobe XD", "InVision", "设计战略", "跨职能合作"]
                }
            }
        },

        {
            "id": "experience_item_4",
            "place": "@link{places.coursera}",
            "period": ["2019/12", "2025/01"],
            "locales": {
                "en": {
                    "title": "Software Engineer, in Principal Financial Group",
                    "description": "Vue2, Vue3, Typescript, JavaScript y .NetCore. Se trabajo en proyectos de flujos de inversión haciendo mejoras e incorporando nuevos productos a la web de Principal. Para la filial Cuprum: Se trabajo en herramientas de asesoría de inversión, en flujos de inversión, entre otros. Manejo de leads (clientes potenciales), e integración con Zendesk mediante tickets para contactar cliente",
                    "tags": ["Vue", "Vue3", "Javascript", "Typescript"]
                },
                "es": {
                    "title": "Software Engineer, en Principal Financial Group",
                    "description": "Vue2, Vue3, Typescript, JavaScript and .NetCore. Work was done on investment flow projects, making improvements and incorporating new products to the Principal website. For the subsidiary Cuprum: Work was done on investment advisory tools, investment flows, among others. Management of leads (potential clients), and integration with Zendesk through tickets to contact the client.",
                    "tags": ["Vue", "Vue3", "Javascript", "Typescript"]
                }
            }
        }
    ]
}